{
	"courses": [
		"bachelors": [
			"major": [
				"CIS 4555": {
					"name":"Systems Development Internship",
					"description":"A capstone experience integrating knowledge and skills gained through other programming and systems development blocks. Involves significant participation in software development projects in a real or simulated business setting.",
					"credits":4
				},
				"CIS 4115": {
					"name":"Artificial Intelligence with Robotics",
					"description":"Gives students an in depth understanding of modern artificial intelligence methodologies, techniques, tools and results. Students learn the theoretical and conceptual components of this discipline. Topics covered: history of AI, search techniques, knowledge representation, reasoning, natural languages, machine learning, robotics, neural networks and expert systems. Students implement the above topics by means of computer programs written in laboratory. Interactions between artificial intelligence and other disciplines will be explored.",
					"credits":4
				},
				"CIS 4109": {
					"name":"Capstone Project",
					"description":"This class acts as an in-depth systems development lifecycle practicum. Students work in teams to analyze, design, implement and document a complete information system. Most projects come from systems design requests from the local community. -- I worked with Animal Allies, a local humane society to recommend, develop, and convert their current website over to a new host. We chose to move forward with Wix. This course allowed for client/team communications, meeting organizating, goal development, and time management.",
					"credits":4
				},
				"CIS 4108": {
					"name":"Project Management",
					"description":"An introduction to project management and the supporting techniques and tools. The block exposes students the project management process, the deliverables produced while managing a project, and the collaborative nature of the project environment.",
					"credits":4
				},
				"CIS 4042": {
					"name":"Computer Security",
					"description":"Explores the ways computer-based information technologies and systems are used to address specific organizational needs. Students will become familiar with the terms, concepts, and issues in information technology management; become involved in the process of developing and modifying information systems which support crucial problem solving and decision-making in organizations; and conduct data analysis using common techniques.",
					"credits":2
				},
				"CIS 4041": {
					"name":"Web Design",
					"description":"Explore the design principles that characterize successful Web sites and use modern tools for creating Web sites. Design issues will include the differences between print and electronic media, working within the limits of the technology, and how the user's contexts and goals affect Web design. Web sites will be critiqued from both an aesthetic and functional standpoint and students will be required to design and build fully functional Web sites.",
					"credits":4
				},
				"CIS 4034": {
					"name":"Server-Side Web Development",
					"description":"Provides an introduction to web site administration and the use of a web development IDE for the creation of database driven web applications. The block focuses on server-side programming and database access for web applications; giving students practical experience with current development environments.",
					"credits":4
				},
				"CIS 3777": {
					"name":"Software Development with Amazon Alexa",
					"description":"This course was an independent study conducted with a professor. This course explored AWS and developing skills for the Amazon Alexa. These skills were developed in both the Java and Python languages.",
					"credits":4
				},
				"CIS 3334": {
					"name":"Mobile Device Programming",
					"description":"Develop applications for a variety of resource constrained devices such as cellular phones, pagers and personal digital assistants (PDAs). Students will explore the creation of graphical user interfaces, data storage, network access and game development. Activities include creating applications for mobile devices using both high-level and low-level industry standard interfaces and developing a distributed application over a wireless network.",
					"credits":4
				}
			],
			"others": [
			
			]
		],
		"masters": [
		
		],
		"others": [
		
		]
	]
}