{
	"summary": {
		"GPA":3.97,
		"majorGPA":3.97,
		"creditsEarned":150
	},
	"courses": [
		"bachelors": [
			"major": [
				"CIS 4555": {
					"name":"Systems Development Internship",
					"description":"A capstone experience integrating knowledge and skills gained through other programming and systems development blocks. Involves significant participation in software development projects in a real or simulated business setting.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 4115": {
					"name":"Artificial Intelligence with Robotics",
					"description":"Gives students an in depth understanding of modern artificial intelligence methodologies, techniques, tools and results. Students learn the theoretical and conceptual components of this discipline. Topics covered: history of AI, search techniques, knowledge representation, reasoning, natural languages, machine learning, robotics, neural networks and expert systems. Students implement the above topics by means of computer programs written in laboratory. Interactions between artificial intelligence and other disciplines will be explored.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 4109": {
					"name":"Capstone Project",
					"description":"This class acts as an in-depth systems development lifecycle practicum. Students work in teams to analyze, design, implement and document a complete information system. Most projects come from systems design requests from the local community. -- I worked with Animal Allies, a local humane society to recommend, develop, and convert their current website over to a new host. We chose to move forward with Wix. This course allowed for client/team communications, meeting organizating, goal development, and time management.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 4108": {
					"name":"Project Management",
					"description":"An introduction to project management and the supporting techniques and tools. The block exposes students the project management process, the deliverables produced while managing a project, and the collaborative nature of the project environment.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 4042": {
					"name":"Computer Security",
					"description":"Explores the ways computer-based information technologies and systems are used to address specific organizational needs. Students will become familiar with the terms, concepts, and issues in information technology management; become involved in the process of developing and modifying information systems which support crucial problem solving and decision-making in organizations; and conduct data analysis using common techniques.",
					"credits":2,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 4041": {
					"name":"Web Design",
					"description":"Explore the design principles that characterize successful Web sites and use modern tools for creating Web sites. Design issues will include the differences between print and electronic media, working within the limits of the technology, and how the user's contexts and goals affect Web design. Web sites will be critiqued from both an aesthetic and functional standpoint and students will be required to design and build fully functional Web sites.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 4034": {
					"name":"Server-Side Web Development",
					"description":"Provides an introduction to web site administration and the use of a web development IDE for the creation of database driven web applications. The block focuses on server-side programming and database access for web applications; giving students practical experience with current development environments.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 3777": {
					"name":"Software Development with Amazon Alexa",
					"description":"This course was an independent study conducted with a professor. This course explored AWS and developing skills for the Amazon Alexa. These skills were developed in both the Java and Python languages.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 3334": {
					"name":"Mobile Device Programming",
					"description":"Develop applications for a variety of resource constrained devices such as cellular phones, pagers and personal digital assistants (PDAs). Students will explore the creation of graphical user interfaces, data storage, network access and game development. Activities include creating applications for mobile devices using both high-level and low-level industry standard interfaces and developing a distributed application over a wireless network.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 3287": {
					"name":"Software Quality Assurance",
					"description":"As our society’s dependence on software grows, so does the importance of software quality. Software failures can have catastrophic effects on companies and people. In this course, students learn the principles of Software Quality Assurance, how to write test plans, and how software quality fits into a project’s development methodology.",
					"credits":2,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 3285": {
					"name":"Software Design",
					"description":"Introduces software engineering and the processes for building software systems. The course examines the software lifecycle and the methods used to manage software projects. Students learn to create software designs from user requirements using UML, convert these design into software, and test and maintain this software. Since software design entails significant interactions between parties, people management and team management methods are explored including analysis of the ethical implications of the software design process.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 3230": {
					"name":"Game Design and 3D Modeling",
					"description":"Introduces the diverse tasks required for 3-D game development. An overview of the game design industry and game development processes lead to development projects that use leading development tools. Sophisticated 3-D models are created using modeling software and incorporated into the development projects. Assessment is based on student's understanding of the methodologies, use of the development tools, and aesthetics of the designs.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 3205": {
					"name":"Information Systems",
					"description":"Explores the ways computer-based information technologies and systems are used to address specific organizational needs. Students will become familiar with the terms, concepts, and issues in information technology management; become involved in the process of developing and modifying information systems which support crucial problem solving and decision-making in organizations; and conduct data analysis using common techniques.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 3108": {
					"name":"Systems Analysis and Design",
					"description":"Focuses on the five phases of the systems development life cycle. Topics include: preliminary investigation, physical and logical documentation, detailed investigation of requirements and alternative specifications, analysis and design techniques, implementation considerations, development of logical and physical data flow diagrams, data modeling, prototyping, CASE tools and the use of Gantt and PERT charts. A sample project is introduced and is integrated using the SDLC methodology.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 3107": {
					"name":"Database Modeling",
					"description":"Provides an understanding of fundamental concepts in the management of data, hands-on experience with a small-scale database management system, and an awareness of the application of business data base management systems. Lab exercises involve use of a relational DBMS to load, update and retrieve information from a database.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 3089": {
					"name":"Data Structures and Algorithm Analysis",
					"description":"Studies fundamental concepts of algorithm analysis and the specification and implementation of data structures and data types are introduced. Topics include linked lists, stacks, queues, binary search trees, sorting, searching and graphs.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 3034": {
					"name":"Client-Side Web Development",
					"description":"Provides an introduction to creating web applications with a rich client-side interface. The block focuses on the use of standards-compliant programming techniques and innovative approaches to user experience design. Gives students practical experience in working with current and emerging web technologies for the client-side of applications.",
					"credits":2,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 2087": {
					"name":"Programming in Java II",
					"description":"Continuation of object-oriented programming. The block deals with problems involving arrays and teaches techniques and methods to handle files and structures. This block expands on the object concepts introduced in CIS 2085.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 2085": {
					"name":"Programming in Java I",
					"description":"Introduces object-oriented programming using the Java language, a cross-platform Internet programming language. The block examines the nature of programming and its use in solving problems. Students learn to read and write programs using standard programming structures, including input/output, control statements, loops and methods.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 2011": {
					"name":"Hardware/Software Systems",
					"description":"A survey of technical topics related to computer systems with emphasis on the relationships between computer hardware, system software and application software. It explores different operating systems (with an emphasis on Microsoft Windows), hardware configurations, memory management techniques, and networking.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 1205": {
					"name":"Technology Ethics",
					"description":"An examination of ways technology challenges traditional ethical, legal and social concepts. This includes issues generated by the use of computers and computer networks, including the Internet and the World Wide Web. Topics for consideration include: privacy, security, computer crime, software piracy, copyrights, intellectual property, free speech, access to information/ censorship, Ecommerce, computers and gender and civil liberties in cyberspace.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"CIS 1007": {
					"name":"Introduction to Databases",
					"description":"The course emphasizes the use of the computer as a tool to manipulate data and produce information. It includes a practical application software emphasis that highlights the use of databases. Students will learn how to create tables, forms, queries, reports and macros using a small-scale database management system.",
					"credits":4,
					"department":"CIS",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				}
			],
			"others": [
				"HIM 2111": {
					"name":"HIM Technologies in Practice",
					"description":"Applies technology to HIM practice including electronic health records, clinical information systems, and management information systems in HIM. Hands on experience with electronic systems and technology applications for creating, managing, and storing and retrieving electronic health data will be used by students to develop their confidence and competence with employing this type of clinical information technology in the practice of their profession.",
					"credits":2,
					"department":"HIM",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"HIM 2110": {
					"name":"Concepts & Principles of HIM",
					"description":"Introduces the field of health information management. Content areas include an overview of the electronic patient record, professional roles within the field, professional organizations and the professional Code of Ethics; the content and structure of manual, computerized and hybrid health record and the standards that govern the development of the record within a health care facility; viewing medical documents and e-forms. Hands-on lab experience will be used by students to develop their confidence and competence with employing this type of clinical information technology in the practice of their profession.",
					"credits":2,
					"department":"HIM",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"ENG 3364": {
					"name":"Management Communications: Written",
					"description":"Emphasizes the writing process as appropriate to the management situation. Students complete a series of writing assignments including letters, memos, proposals, problem-solving reports, informational reports and group writing projects. The emphasis is on audience adaptation, clarity of purpose, adequacy of support and correct format. Students will be introduced to writing for the electronic media.",
					"credits":4,
					"department":"ENG",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				},
				"PSY 3331": {
					"name":"Statistics",
					"description":"Covers basic statistical concepts and methods useful in conducting research and evaluating results of studies done by others. Topics include frequency distributions and graphs, measures of central tendency and variability, transformed scores, correlations, multiple regression, hypothesis testing (t test, analysis of variance, and chi square), selection of appropriate statistics, calculation with MS Excel spreadsheets and SPSS, interpretation of the 'results' sections of journal articles, and numeracy (understanding and using numbers in decision-making).",
					"credits":4,
					"department":"PSY",
					"school":"College of Saint Scholastica",
					"format":"In Person"
				}
			]
		],
		"masters": [
		
		],
		"others": [
		
		]
	]
}